from math import nan

import pytest


@pytest.fixture
def empty_date():
    return ""


@pytest.fixture
def bad_date():
    return "28.12.2021 bb:36:dd"


@pytest.fixture
def mock_transactions_for_period():
    return [
        {
            "Дата операции": "04.06.2018 17:33:19",
            "Дата платежа": "04.06.2018",
            "Номер карты": "*1112",
            "Статус": "FAILED",
            "Сумма операции": -4003.54,
            "Валюта операции": "RUB",
            "Сумма платежа": -4003.54,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": nan,
            "MCC": nan,
            "Описание": "Перевод с карты",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 4003.54,
        },
        {
            "Дата операции": "03.06.2018 21:38:23",
            "Дата платежа": "03.06.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -1000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -1000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": nan,
            "MCC": nan,
            "Описание": "Перевод с карты",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Дата операции": "03.06.2018 14:19:08",
            "Дата платежа": "03.06.2018",
            "Номер карты": nan,
            "Статус": "OK",
            "Сумма операции": -22000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -22000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Переводы",
            "MCC": nan,
            "Описание": "Константин Ф.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 22000.0,
        },
        {
            "Дата операции": "03.06.2018 10:23:52",
            "Дата платежа": "05.06.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -512.95,
            "Валюта операции": "RUB",
            "Сумма платежа": -512.95,
            "Валюта платежа": "RUB",
            "Кэшбэк": nan,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "SPAR",
            "Бонусы (включая кэшбэк)": 10,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 512.95,
        },
        {
            "Дата операции": "02.06.2018 14:07:54",
            "Дата платежа": "05.06.2018",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -164.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -164.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.0,
            "Категория": "Ж/д билеты",
            "MCC": 4111.0,
            "Описание": "Северо-Западная пригородная пассажирская компания",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 164.0,
        },
    ]


@pytest.fixture
def mock_empty_transactions_for_period():
    return []


@pytest.fixture
def current_currency_rate():
    return [
        {
            "success": True,
            "query": {"from": "USD", "to": "RUB", "amount": 1},
            "info": {"timestamp": 1736632635, "rate": 101.640033},
            "date": "2025-01-11",
            "result": 101.640033,
        },
        {
            "success": True,
            "query": {"from": "EUR", "to": "RUB", "amount": 1},
            "info": {"timestamp": 1736632635, "rate": 104.230108},
            "date": "2025-01-11",
            "result": 104.230108,
        },
    ]
